UKS/src/Reports/ФактическиОтработаноеВремя/ФактическиОтработаноеВремя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ФактическиОтработаноеВремя</name>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Report>

UKS/src/InformationRegisters/РегистрВыполненыхРабот/РегистрВыполненыхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрВыполненыхРабот</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеРешения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоЧасов</name>
    <comment>Количество отработанных часов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоМинут</name>
    <comment>Количество отработанных минут</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВыполнившийСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UKS/src/Documents/ЗаявкаНаРемонт/ЗаявкаНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаРемонт</name>
  <registerRecords>InformationRegister.СостояниеРемонта</registerRecords>
  <registerRecords>InformationRegister.РегистрВыполненыхРабот</registerRecords>
  <attributes>
    <name>ВнутНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнившийСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачиРемонта</name>
    <type>
      <types>EnumRef.СостояниеРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>Кабинет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеРешения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоискИнвентарныйНомер</name>
    <comment>Инвентарный номер оборудования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическиОтработаноеВремяЧасов</name>
    <comment>Время потрачеоное на работу</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическиОтработаноеВремяМинут</name>
    <comment>Время потрачеоное на работу минут</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

UKS/src/Reports/ФактическиОтработаноеВремя/Forms/ФормаОтчета/Module.bsl
&НаСервере
Функция ПолучитьРаботу(ДокументСсылка)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаРемонт.ОписаниеПроблемы КАК Работа
		|ИЗ
		|	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
		|ГДЕ
		|	ЗаявкаНаРемонт.Ссылка = &ДокументСсылка";
	
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат СокрЛП(ВыборкаДетальныеЗаписи.Работа);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервере
Функция ПолучитьВыполненыеРаботы()
	
	Макет = Отчеты.ФактическиОтработаноеВремя.ПолучитьМакет("СписокРабот");
	
	ДокументПечати = Новый ТабличныйДокумент;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьШапка.Параметры.СтрокаПериод = СтрШаблон("%1 - %2",Формат(Отчет.ПериодОтчета.ДатаНачала,"ДЛФ=D"),Формат(Отчет.ПериодОтчета.ДатаОкончания,"ДЛФ=D"));
	ДокументПечати.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрВыполненыхРабот.ВыполнившийСотрудник КАК Сотрудник,
		|	РегистрВыполненыхРабот.ДатаВыполнения КАК ДатаВыполнения,
		|	РегистрВыполненыхРабот.КоличествоЧасов КАК КоличествоЧасов,
		|	РегистрВыполненыхРабот.КоличествоМинут КАК КоличествоМинут,
		|	РегистрВыполненыхРабот.Регистратор КАК Регистратор,
		|	РегистрВыполненыхРабот.ДатаПринятия КАК ДатаПринятия
		|ИЗ
		|	РегистрСведений.РегистрВыполненыхРабот КАК РегистрВыполненыхРабот
		|ГДЕ
		|	РегистрВыполненыхРабот.Период МЕЖДУ &ПериодС И &ПериодПо";
	
	Запрос.УстановитьПараметр("ПериодС",Отчет.ПериодОтчета.ДатаНачала);
	Запрос.УстановитьПараметр("ПериодПо",Отчет.ПериодОтчета.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ИтогоКоличествоЧасов = 0; ИтогоКоличествоМинут = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаСтруктруа = Новый Структура;
		СтрокаСтруктруа.Вставить("Сотрудник",ОбщийСправочникиКлиентСервер.ФамилияИнициалы(ВыборкаДетальныеЗаписи.Сотрудник,,,,Истина));
		СтрокаСтруктруа.Вставить("Работа",ПолучитьРаботу(ВыборкаДетальныеЗаписи.Регистратор));
		ДатаПринятия = Формат(ВыборкаДетальныеЗаписи.ДатаПринятия,"ДЛФ=D");
		ДатаВыполнения = Формат(ВыборкаДетальныеЗаписи.ДатаВыполнения,"ДЛФ=D");
		Если ДатаПринятия=ДатаВыполнения Тогда
			СтрокаСтруктруа.Вставить("ДатаВыполнения",ДатаВыполнения);
		Иначе
			СтрокаСтруктруа.Вставить("ДатаВыполнения",СтрШаблон("%1 - %2",ДатаПринятия,ДатаВыполнения));
		КонецЕсли;
		СтрокаСтруктруа.Вставить("ЗатраченоеВремя",СтрШаблон("%1:%2",
											Формат(ВыборкаДетальныеЗаписи.КоличествоЧасов,"ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0"),
											Формат(ВыборкаДетальныеЗаписи.КоличествоМинут,"ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0")));
		ОбластьСтрока.Параметры.Заполнить(СтрокаСтруктруа);
		ДокументПечати.Вывести(ОбластьСтрока);
		ИтогоКоличествоЧасов = ИтогоКоличествоЧасов+ВыборкаДетальныеЗаписи.КоличествоЧасов;
		ИтогоКоличествоМинут = ИтогоКоличествоМинут+ВыборкаДетальныеЗаписи.КоличествоМинут;
	КонецЦикла;
	
	СтруктураПодвал = Новый Структура;
	ПолныхЧасов = Цел(ИтогоКоличествоМинут/60);
	ПолныхМинут = ИтогоКоличествоМинут-(ПолныхЧасов*60);
	ПолныхЧасов = ПолныхЧасов+ИтогоКоличествоЧасов;
	СтруктураПодвал.Вставить("ИтогоВремя",СтрШаблон("%1 ч. %2 мин.",
										Формат(ПолныхЧасов,"ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0"),
										Формат(ПолныхМинут,"ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0")));
	ОбластьПодвал.Параметры.Заполнить(СтруктураПодвал);
	ДокументПечати.Вывести(ОбластьПодвал);
	
	Возврат ДокументПечати;
	
КонецФункции


&НаКлиенте
Процедура Сформировать(Команда)
	
	ДокументПечати = ПолучитьВыполненыеРаботы();
	ДокументПечати.Показать();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.ПериодОтчета.Вариант = ВариантСтандартногоПериода.ПрошлыйМесяц;
	
КонецПроцедуры
